xml-v4/InformationRegisters/TL_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>TL_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml-v4/CommonModules/TL_Настройки/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль TL_Настройки
// Расширение TradeLedger v4 для 1С:БП 3.0
// Контекст: Сервер, Экспорт
//
// Единый модуль настроек И маппинга (заменяет TL_Настройки + TL_Маппинг).
// Все данные хранятся в регистре TL_Настройки (flat key-value).
//
// Ключи маппинга (примеры):
//   Станция_5_Склад         = "АКЗС Витебский"
//   Станция_5_ВремяЗакрытия = "00:00"
//   Топливо_2_Тонны         = "АИ-92(т)"
//   Топливо_2_Литры         = "АИ-92 (л)"
//   Топливо_2_Плотность     = "0.738"
//   Оплата_cards_Склад      = "Карты"
//   Оплата_cards_ТребуетПеремещения = "Да"
//
// Каждая функция маппинга: регистр -> fallback НайтиПоНаименованию.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получить строковое значение настройки.
//
// Параметры:
//   Ключ                 - Строка - ключ настройки
//   ЗначениеПоУмолчанию  - Строка - если настройка не найдена
//
// Возвращаемое значение:
//   Строка
//
Функция ПолучитьЗначение(Ключ, ЗначениеПоУмолчанию = "") Экспорт

	// Попытка чтения из регистра TL_Настройки
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	TL_Настройки.Значение КАК Значение
			|ИЗ
			|	РегистрСведений.TL_Настройки КАК TL_Настройки
			|ГДЕ
			|	TL_Настройки.Ключ = &Ключ";

		Запрос.УстановитьПараметр("Ключ", Ключ);
		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат Выборка.Значение;
		КонецЕсли;
	Исключение
		// Регистр TL_Настройки не существует — fallback ниже
	КонецПопытки;

	// Fallback: ХранилищеОбщихНастроек (обратная совместимость)
	Попытка
		Зн = ХранилищеОбщихНастроек.Загрузить("TL_" + Ключ);
		Если Зн <> Неопределено И ЗначениеЗаполнено(Зн) Тогда
			Возврат Строка(Зн);
		КонецЕсли;
	Исключение
	КонецПопытки;

	Возврат ЗначениеПоУмолчанию;

КонецФункции

// Получить числовое значение настройки.
//
Функция ПолучитьЧисло(Ключ, ЗначениеПоУмолчанию = 0) Экспорт

	СтроковоеЗначение = ПолучитьЗначение(Ключ, XMLСтрока(ЗначениеПоУмолчанию));

	Попытка
		Возврат Число(СтроковоеЗначение);
	Исключение
		Возврат ЗначениеПоУмолчанию;
	КонецПопытки;

КонецФункции

// Установить значение настройки.
//
// Параметры:
//   Ключ      - Строка
//   Значение  - Строка
//   Описание  - Строка (необязательно)
//
Процедура УстановитьЗначение(Ключ, Значение, Описание = "") Экспорт

	Попытка
		МенеджерЗаписи = РегистрыСведений.TL_Настройки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Ключ = Ключ;
		МенеджерЗаписи.Прочитать();

		МенеджерЗаписи.Ключ = Ключ;
		МенеджерЗаписи.Значение = Значение;

		Если Не ПустаяСтрока(Описание) Тогда
			МенеджерЗаписи.Описание = Описание;
		КонецЕсли;

		МенеджерЗаписи.Записать();
	Исключение
		// Регистр не существует — пишем в ХранилищеОбщихНастроек
		Попытка
			ХранилищеОбщихНастроек.Сохранить("TL_" + Ключ, , Значение);
		Исключение
		КонецПопытки;
	КонецПопытки;

КонецПроцедуры

// Получить организацию из настроек.
// Ищет по наименованию из настройки "Организация".
// Fallback: первая неудалённая организация.
//
// Возвращаемое значение:
//   СправочникСсылка.Организации
//
Функция ПолучитьОрганизацию() Экспорт

	Наименование = ПолучитьЗначение("Организация", "");

	Если ЗначениеЗаполнено(Наименование) Тогда
		Результат = Справочники.Организации.НайтиПоНаименованию(Наименование, Истина);
		Если ЗначениеЗаполнено(Результат) Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	// Fallback: первая неудалённая
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка
		|ИЗ
		|	Справочник.Организации
		|ГДЕ
		|	НЕ ПометкаУдаления";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Справочники.Организации.ПустаяСсылка();

КонецФункции

// Получить основной склад из настроек.
// Fallback: первый неудалённый склад.
//
// Возвращаемое значение:
//   СправочникСсылка.Склады
//
Функция ПолучитьОсновнойСклад() Экспорт

	Наименование = ПолучитьЗначение("ОсновнойСклад", "");

	Если ЗначениеЗаполнено(Наименование) Тогда
		Результат = Справочники.Склады.НайтиПоНаименованию(Наименование, Истина);
		Если ЗначениеЗаполнено(Результат) Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	// Fallback: первый неудалённый
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка
		|ИЗ
		|	Справочник.Склады
		|ГДЕ
		|	НЕ ПометкаУдаления";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Справочники.Склады.ПустаяСсылка();

КонецФункции

// Получить поставщика из настроек.
// Fallback: БАЛТОП / Сургутнефтегаз.
//
// Возвращаемое значение:
//   СправочникСсылка.Контрагенты
//
Функция ПолучитьПоставщика() Экспорт

	Наименование = ПолучитьЗначение("Поставщик", "");

	Если ЗначениеЗаполнено(Наименование) Тогда
		Результат = Справочники.Контрагенты.НайтиПоНаименованию(Наименование, Истина);
		Если ЗначениеЗаполнено(Результат) Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	// Fallback: стандартные поставщики
	ИскатьИмена = Новый Массив;
	ИскатьИмена.Добавить("БАЛТОП");
	ИскатьИмена.Добавить("Балтоп");
	ИскатьИмена.Добавить("СУРГУТНЕФТЕГАЗ");
	ИскатьИмена.Добавить("Сургутнефтегаз");

	Для Каждого Имя Из ИскатьИмена Цикл
		Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(Имя, Истина);
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Возврат Контрагент;
		КонецЕсли;
	КонецЦикла;

	Возврат Справочники.Контрагенты.ПустаяСсылка();

КонецФункции

// Получить ставку НДС из настроек (по умолчанию 22%).
// Читает ключ «СтавкаНДС» из регистра: "22" → НДС22, "20" → НДС20.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.СтавкиНДС или Неопределено
//
Функция ПолучитьСтавкуНДС() Экспорт

	СтавкаСтр = ПолучитьЗначение("СтавкаНДС", "22");

	Если СтавкаСтр = "20" Тогда
		Попытка Возврат Перечисления.СтавкиНДС.НДС20; Исключение КонецПопытки;
	КонецЕсли;

	Попытка Возврат Перечисления.СтавкиНДС.НДС22; Исключение КонецПопытки;
	Попытка Возврат Перечисления.СтавкиНДС.НДС20; Исключение КонецПопытки;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#Область Маппинг

// ============================================================================
// ДЕЛЕГИРОВАНИЕ В TL_Маппинг (справочники v4)
// Каждая функция сначала пытается TL_Маппинг (справочники TL_АЗС,
// TL_ВидыТоплива, TL_ВидыОплат). Если справочники пусты или не существуют —
// fallback на key-value из регистра TL_Настройки.
// ============================================================================

// Найти склад АЗС по коду станции.
// Приоритет: key-value (точная настройка) → TL_Маппинг (справочник TL_АЗС с fallback масками).
//
Функция НайтиСкладСтанции(КодСтанции) Экспорт

	// 1. Key-value регистр (точная настройка всегда приоритетнее)
	КодСтр = XMLСтрока(КодСтанции);
	НаимСклада = ПолучитьЗначение("Станция_" + КодСтр + "_Склад", "");
	Если ЗначениеЗаполнено(НаимСклада) Тогда
		Склад = Справочники.Склады.НайтиПоНаименованию(НаимСклада, Истина);
		Если ЗначениеЗаполнено(Склад) Тогда
			Возврат Склад;
		КонецЕсли;
	КонецЕсли;

	// 2. Через справочник TL_АЗС (делегат в TL_Маппинг, включая маски)
	Попытка
		Склад = TL_Маппинг.НайтиСкладСтанции(КодСтанции);
		Если ЗначениеЗаполнено(Склад) Тогда
			Возврат Склад;
		КонецЕсли;
	Исключение
	КонецПопытки;

	Возврат Справочники.Склады.ПустаяСсылка();

КонецФункции

// Нормализовать дату смены с учётом времени закрытия станции.
// Приоритет: TL_Маппинг (справочник TL_АЗС) → key-value.
//
Функция НормализоватьДатуСмены(ДатаСмены, КодСтанции) Экспорт

	// 1. Через TL_Маппинг (справочник TL_АЗС)
	Попытка
		Возврат TL_Маппинг.НормализоватьДатуСмены(ДатаСмены, КодСтанции);
	Исключение
	КонецПопытки;

	// 2. Fallback: key-value
	Если Не ЗначениеЗаполнено(ДатаСмены) Тогда
		Возврат ДатаСмены;
	КонецЕсли;

	КодСтр = XMLСтрока(КодСтанции);
	ВремяСтр = ПолучитьЗначение("Станция_" + КодСтр + "_ВремяЗакрытия", "00:00");

	Если ВремяСтр = "00:00" ИЛИ Не ЗначениеЗаполнено(ВремяСтр) Тогда
		Возврат НачалоДня(ДатаСмены);
	КонецЕсли;

	Попытка
		ЧасЗакрытия = Число(Лев(ВремяСтр, СтрНайти(ВремяСтр, ":") - 1));
	Исключение
		Возврат НачалоДня(ДатаСмены);
	КонецПопытки;

	Если ЧасЗакрытия = 0 Тогда
		Возврат НачалоДня(ДатаСмены);
	КонецЕсли;

	Если Час(ДатаСмены) < ЧасЗакрытия Тогда
		Возврат НачалоДня(ДатаСмены - 86400);
	КонецЕсли;

	Возврат НачалоДня(ДатаСмены);

КонецФункции

// Найти номенклатуру топлива по внешнему коду API.
// Приоритет: TL_Маппинг (справочник TL_ВидыТоплива + ТЧ по станциям) → key-value → хардкод.
//
Функция НайтиНоменклатуруТоплива(КодТоплива, Единица, КодСтанции = 0) Экспорт

	// 1. Через справочник TL_ВидыТоплива (делегат в TL_Маппинг)
	Попытка
		Номенклатура = TL_Маппинг.НайтиНоменклатуруТоплива(КодТоплива, Единица, КодСтанции);
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			Возврат Номенклатура;
		КонецЕсли;
	Исключение
	КонецПопытки;

	// 2. Fallback: key-value регистр
	КодСтр = Строка(КодТоплива);
	СуффиксЕдиницы = ?(НРег(Единица) = "т", "Тонны", "Литры");
	НаимНоменклатуры = ПолучитьЗначение("Топливо_" + КодСтр + "_" + СуффиксЕдиницы, "");
	Если ЗначениеЗаполнено(НаимНоменклатуры) Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаимНоменклатуры, Истина);
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			Возврат Номенклатура;
		КонецЕсли;
	КонецЕсли;

	Возврат Справочники.Номенклатура.ПустаяСсылка();

КонецФункции

// Получить отображаемое наименование топлива по коду API.
// Приоритет: справочник TL_ВидыТоплива → key-value → хардкод.
//
Функция ПолучитьНаименованиеТоплива(КодТоплива) Экспорт

	КодСтр = Строка(КодТоплива);

	// 1. Через справочник TL_ВидыТоплива
	Попытка
		ВидТоплива = TL_Маппинг.НайтиВидТоплива(КодТоплива);
		Если ВидТоплива <> Неопределено Тогда
			Возврат ВидТоплива.Наименование;
		КонецЕсли;
	Исключение
	КонецПопытки;

	// 2. Fallback: key-value
	Наименование = ПолучитьЗначение("Топливо_" + КодСтр + "_Литры", "");
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Наименование = ПолучитьЗначение("Топливо_" + КодСтр + "_Тонны", "");
	КонецЕсли;

	Если ЗначениеЗаполнено(Наименование) Тогда
		Наименование = СокрЛП(Наименование);
		Если Прав(Наименование, 4) = " (л)" ИЛИ Прав(Наименование, 4) = " (т)" Тогда
			Наименование = Лев(Наименование, СтрДлина(Наименование) - 4);
		ИначеЕсли Прав(Наименование, 3) = "(л)" ИЛИ Прав(Наименование, 3) = "(т)" Тогда
			Наименование = Лев(Наименование, СтрДлина(Наименование) - 3);
		КонецЕсли;
		Если ЗначениеЗаполнено(Наименование) Тогда
			Возврат СокрЛП(Наименование);
		КонецЕсли;
	КонецЕсли;

	// 3. Fallback: хардкод
	МаппингИмён = Новый Соответствие;
	МаппингИмён.Вставить("2",   "АИ-92");
	МаппингИмён.Вставить("3",   "АИ-95");
	МаппингИмён.Вставить("5",   "ДТ");
	МаппингИмён.Вставить("100", "АИ-100");
	МаппингИмён.Вставить("98",  "АИ-98");

	ИмяТоплива = МаппингИмён.Получить(КодСтр);
	Возврат ?(ИмяТоплива <> Неопределено, ИмяТоплива, КодСтр);

КонецФункции

// Найти вид оплаты по внешнему ключу из API.
// Приоритет: TL_Маппинг (справочник TL_ВидыОплат) → key-value.
//
Функция НайтиВидОплаты(КлючОплаты) Экспорт

	// 1. Через справочник TL_ВидыОплат (делегат в TL_Маппинг)
	Попытка
		Результат = TL_Маппинг.НайтиВидОплаты(КлючОплаты);
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
	Исключение
	КонецПопытки;

	// 2. Fallback: key-value регистр
	НаимКанала = ПолучитьЗначение("Оплата_" + КлючОплаты + "_Наименование", "");
	НаимСклада = ПолучитьЗначение("Оплата_" + КлючОплаты + "_Склад", "");
	ТребуетСтр = ПолучитьЗначение("Оплата_" + КлючОплаты + "_ТребуетПеремещения", "");

	Если Не ЗначениеЗаполнено(НаимКанала) И Не ЗначениеЗаполнено(НаимСклада)
		И Не ЗначениеЗаполнено(ТребуетСтр) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТребуетПеремещения = (НРег(ТребуетСтр) = "да" ИЛИ НРег(ТребуетСтр) = "true" ИЛИ НРег(ТребуетСтр) = "1");

	Склад = Справочники.Склады.ПустаяСсылка();
	Если ЗначениеЗаполнено(НаимСклада) Тогда
		Склад = Справочники.Склады.НайтиПоНаименованию(НаимСклада, Истина);
	КонецЕсли;

	НаимКонтр = ПолучитьЗначение("Оплата_" + КлючОплаты + "_Контрагент", "");
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	Если ЗначениеЗаполнено(НаимКонтр) Тогда
		Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(НаимКонтр, Истина);
	КонецЕсли;

	Возврат Новый Структура("Склад, ТребуетПеремещения, КонтрагентОптовый",
		Склад, ТребуетПеремещения, Контрагент);

КонецФункции

// Получить плотность топлива.
// Приоритет: TL_Маппинг (регистр TL_ПлотностьПартий + справочная) → key-value.
//
Функция ПолучитьПлотность(КодТоплива, КодСтанции = 0, Дата = Неопределено) Экспорт

	// 1. Через TL_Маппинг (регистр ПлотностьПартий + справочная)
	Попытка
		Плотность = TL_Маппинг.ПолучитьПлотность(КодТоплива, КодСтанции, ?(Дата = Неопределено, ТекущаяДата(), Дата));
		Если Плотность > 0 Тогда
			Возврат Плотность;
		КонецЕсли;
	Исключение
	КонецПопытки;

	// 2. Fallback: key-value
	КодСтр = Строка(КодТоплива);
	ПлотностьСтр = ПолучитьЗначение("Топливо_" + КодСтр + "_Плотность", "0");
	Попытка
		Возврат Число(ПлотностьСтр);
	Исключение
		Возврат 0;
	КонецПопытки;

КонецФункции

// Записать плотность партии.
// Приоритет: TL_Маппинг (регистр TL_ПлотностьПартий) → key-value.
//
Процедура ЗаписатьПлотность(КодТоплива, КодСтанции, Дата, Плотность, МассаКг, ОбъёмЛитров, НомерТТН) Экспорт

	Если Плотность = 0 Тогда
		Возврат;
	КонецЕсли;

	// 1. Через TL_Маппинг (регистр TL_ПлотностьПартий)
	Попытка
		TL_Маппинг.ЗаписатьПлотность(КодТоплива, КодСтанции, Дата, Плотность, МассаКг, ОбъёмЛитров, НомерТТН);
		Возврат;
	Исключение
	КонецПопытки;

	// 2. Fallback: key-value
	КодСтр = Строка(КодТоплива);
	ДатаСтр = Формат(Дата, "ДФ='yyyyMMdd'");
	Попытка
		УстановитьЗначение(
			"ПлотностьПартии_" + КодСтр + "_" + ДатаСтр,
			Формат(Плотность, "ЧДЦ=4; ЧРД=."),
			"ТТН №" + НомерТТН + " масса=" + XMLСтрока(МассаКг) + "кг объём=" + XMLСтрока(ОбъёмЛитров) + "л");
	Исключение
		ЗаписьЖурналаРегистрации("TL_Настройки",
			УровеньЖурналаРегистрации.Предупреждение, , ,
			"Не удалось записать плотность: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
